cyr = ('а','ә','б','в','г','ғ','д','е','ё','ж','з','и','й','к','қ','л','м','н','ң','о','ө','п','р','с','т','у','ұ','ү','ф', 'х', 'һ','ц','ч','ш','щ','ъ','ы','і','ь','э','ю','я')
lat = ('a','a','b','v','g','g','d','e','io','j','z','i','i','k','q','l','m','n','n','o','o','p','r','s','t','u','u','u','f','h','h','ts','ch','sh','shch','','y','i','','e','iu','ia')
soz = input("Soz: ")
for i in soz:
    n = 0
    for j in cyr:
        if j == i:
            print(lat[n],end="")
            break
        elif i.lower() == j:
            print(lat[n].upper(),end="")
            break
        n +=1
print('')
